%% common_params.m
% 公共参数文件
% 注意：这里不要写 clear、clc、close all
% 所有模型运行前先 run('common_params.m')

%% 时间参数
T = 24;
hours = 1:T;

%% 求解器设置
solver_name = 'gurobi';

%% 电价参数

price_G = [
    0.3376; 0.3376; 0.3376; 0.3376; 0.3376; 0.3376;
    0.3376; 0.3376; 0.5980; 0.5980; 0.5980; 0.5980;
    0.8654; 0.8654; 0.8654; 0.5980; 0.5980; 0.5980;
    0.5980; 0.8654; 0.8654; 0.8654; 0.8654; 0.3376
];

price_WT2G = 0.34;     % 风电上网电价
price_PV2G = 0.40;     % 光伏上网电价

%% 风电参数

cost_WT_om_coeff = 0.008;       % 风电单位发电运维成本系数
cost_WT2H_quad_coeff = 0.00003;       % 风电向电制氢售电过网费二次项系数
cost_WT2H_linear_coeff = 0.01;        % 风电向电制氢售电过网费一次项系数

%% 光伏参数

cost_PV_om_coeff = 0.0085;      % 光伏单位发电运维成本系数
cost_PV2H_quad_coeff = 0.00003;       % 光伏向电制氢售电过网费二次项系数
cost_PV2H_linear_coeff = 0.01;        % 光伏向电制氢售电过网费一次项系数

%% 电制氢系统参数

H_yield_coeff = 0.019224;       % 单位电功率产氢系数

P_el_max = 5000;                % 电解槽最大输入功率
P_el_rp_max = 1000;             % 电解槽爬坡约束

H_spec2Heat = 14.304;           % 氢气比热容常数
T_in = 40;                      % 压缩机输入氢气温度
n_com = 0.7;                    % 压缩机效率
K = 1.4;                        % 氢气等熵指数
k1 = (K - 1) / K;               % 压缩机模型指数

volume_tank_H = 500;            % 储氢罐容量
Temp_tank_H = 60;               % 储氢罐内部温度
H_mol = 0.002;                  % 氢气摩尔质量
Flow_com_H = 0.004;             % 压缩机压缩氢气流量

H_tank_press_min = 20;          % 储氢罐最小气压
H_tank_press_max = 40;          % 储氢罐最大气压
H_tank_t0 = 28;                 % 储氢罐初始气压

E_ba_min = 200;                 % 储能最小容量
E_ba_max = 1800;                % 储能最大容量
E_ba_t0 = 1000;                 % 储能初始容量

E_ba_c = 0.95;                  % 储能充电效率
E_ba_dis = 0.96;                % 储能放电效率

P_ba_c_max = 500;               % 储能最大充电功率
P_ba_dis_max = 600;             % 储能最大放电功率

el_om_coeff = 0.022;            % 电解槽运维成本系数
ba_om_coeff = 0.00018;          % 储能运维成本系数